{"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "input_16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 34, 20], "dtype": "float32", "sparse": false, "name": "input_16"}, "inbound_nodes": []}, {"name": "conv1d_16", "class_name": "Conv1D", "config": {"name": "conv1d_16", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 20], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "conv1d_15", "class_name": "Conv1D", "config": {"name": "conv1d_15", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "max_pooling1d_8", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_8", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]]}, {"name": "bidirectional_15", "class_name": "Bidirectional", "config": {"name": "bidirectional_15", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_15", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["conv1d_15", 0, 0, {}]]]}, {"name": "bidirectional_16", "class_name": "Bidirectional", "config": {"name": "bidirectional_16", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_16", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["max_pooling1d_8", 0, 0, {}]]]}, {"name": "flatten_29", "class_name": "Flatten", "config": {"name": "flatten_29", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional_15", 0, 0, {}]]]}, {"name": "flatten_30", "class_name": "Flatten", "config": {"name": "flatten_30", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional_16", 0, 0, {}]]]}, {"name": "time_distributed_15", "class_name": "TimeDistributed", "config": {"name": "time_distributed_15", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_53", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]]}, {"name": "time_distributed_16", "class_name": "TimeDistributed", "config": {"name": "time_distributed_16", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_54", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["conv1d_15", 0, 0, {}]]]}, {"name": "concatenate_15", "class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_29", 0, 0, {}], ["flatten_30", 0, 0, {}]]]}, {"name": "flatten_31", "class_name": "Flatten", "config": {"name": "flatten_31", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]]}, {"name": "flatten_32", "class_name": "Flatten", "config": {"name": "flatten_32", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]]}, {"name": "dense_50", "class_name": "Dense", "config": {"name": "dense_50", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"name": "permute_15", "class_name": "Permute", "config": {"name": "permute_15", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["flatten_31", 0, 0, {}]]]}, {"name": "permute_16", "class_name": "Permute", "config": {"name": "permute_16", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["conv1d_15", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["flatten_32", 0, 0, {}]]]}, {"name": "dense_51", "class_name": "Dense", "config": {"name": "dense_51", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_50", 0, 0, {}]]]}, {"name": "dot_15", "class_name": "Dot", "config": {"name": "dot_15", "trainable": true, "dtype": "float32", "axes": -1, "normalize": false}, "inbound_nodes": [[["permute_15", 0, 0, {}], ["activation_15", 0, 0, {}]]]}, {"name": "dot_16", "class_name": "Dot", "config": {"name": "dot_16", "trainable": true, "dtype": "float32", "axes": -1, "normalize": false}, "inbound_nodes": [[["permute_16", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"name": "dense_52", "class_name": "Dense", "config": {"name": "dense_52", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_51", 0, 0, {}]]]}, {"name": "concatenate_16", "class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dot_15", 0, 0, {}], ["dot_16", 0, 0, {}], ["dense_52", 0, 0, {}]]]}, {"name": "dense_55", "class_name": "Dense", "config": {"name": "dense_55", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"name": "dense_56", "class_name": "Dense", "config": {"name": "dense_56", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_55", 0, 0, {}]]]}], "input_layers": [["input_15", 0, 0], ["input_16", 0, 0]], "output_layers": [["dense_56", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}