{"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "input_20", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 34, 20], "dtype": "float32", "sparse": false, "name": "input_20"}, "inbound_nodes": []}, {"name": "conv1d_20", "class_name": "Conv1D", "config": {"name": "conv1d_20", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "input_19", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 20], "dtype": "float32", "sparse": false, "name": "input_19"}, "inbound_nodes": []}, {"name": "conv1d_19", "class_name": "Conv1D", "config": {"name": "conv1d_19", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_19", 0, 0, {}]]]}, {"name": "max_pooling1d_10", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_10", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_20", 0, 0, {}]]]}, {"name": "bidirectional_19", "class_name": "Bidirectional", "config": {"name": "bidirectional_19", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_19", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]]]}, {"name": "bidirectional_20", "class_name": "Bidirectional", "config": {"name": "bidirectional_20", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_20", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["max_pooling1d_10", 0, 0, {}]]]}, {"name": "flatten_37", "class_name": "Flatten", "config": {"name": "flatten_37", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional_19", 0, 0, {}]]]}, {"name": "flatten_38", "class_name": "Flatten", "config": {"name": "flatten_38", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional_20", 0, 0, {}]]]}, {"name": "time_distributed_19", "class_name": "TimeDistributed", "config": {"name": "time_distributed_19", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_67", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["conv1d_20", 0, 0, {}]]]}, {"name": "time_distributed_20", "class_name": "TimeDistributed", "config": {"name": "time_distributed_20", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_68", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]]]}, {"name": "concatenate_19", "class_name": "Concatenate", "config": {"name": "concatenate_19", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_37", 0, 0, {}], ["flatten_38", 0, 0, {}]]]}, {"name": "flatten_39", "class_name": "Flatten", "config": {"name": "flatten_39", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]]}, {"name": "flatten_40", "class_name": "Flatten", "config": {"name": "flatten_40", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]]}, {"name": "dense_64", "class_name": "Dense", "config": {"name": "dense_64", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_19", 0, 0, {}]]]}, {"name": "permute_19", "class_name": "Permute", "config": {"name": "permute_19", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["conv1d_20", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["flatten_39", 0, 0, {}]]]}, {"name": "permute_20", "class_name": "Permute", "config": {"name": "permute_20", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["flatten_40", 0, 0, {}]]]}, {"name": "dense_65", "class_name": "Dense", "config": {"name": "dense_65", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_64", 0, 0, {}]]]}, {"name": "dot_19", "class_name": "Dot", "config": {"name": "dot_19", "trainable": true, "dtype": "float32", "axes": -1, "normalize": false}, "inbound_nodes": [[["permute_19", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"name": "dot_20", "class_name": "Dot", "config": {"name": "dot_20", "trainable": true, "dtype": "float32", "axes": -1, "normalize": false}, "inbound_nodes": [[["permute_20", 0, 0, {}], ["activation_20", 0, 0, {}]]]}, {"name": "dense_66", "class_name": "Dense", "config": {"name": "dense_66", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_65", 0, 0, {}]]]}, {"name": "concatenate_20", "class_name": "Concatenate", "config": {"name": "concatenate_20", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dot_19", 0, 0, {}], ["dot_20", 0, 0, {}], ["dense_66", 0, 0, {}]]]}, {"name": "dense_69", "class_name": "Dense", "config": {"name": "dense_69", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_20", 0, 0, {}]]]}, {"name": "dense_70", "class_name": "Dense", "config": {"name": "dense_70", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_69", 0, 0, {}]]]}], "input_layers": [["input_19", 0, 0], ["input_20", 0, 0]], "output_layers": [["dense_70", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}