{"class_name": "Model", "config": {"name": "model_9", "layers": [{"name": "input_18", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 34, 20], "dtype": "float32", "sparse": false, "name": "input_18"}, "inbound_nodes": []}, {"name": "conv1d_18", "class_name": "Conv1D", "config": {"name": "conv1d_18", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_18", 0, 0, {}]]]}, {"name": "input_17", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 20], "dtype": "float32", "sparse": false, "name": "input_17"}, "inbound_nodes": []}, {"name": "conv1d_17", "class_name": "Conv1D", "config": {"name": "conv1d_17", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"name": "max_pooling1d_9", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_9", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_18", 0, 0, {}]]]}, {"name": "bidirectional_17", "class_name": "Bidirectional", "config": {"name": "bidirectional_17", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_17", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["conv1d_17", 0, 0, {}]]]}, {"name": "bidirectional_18", "class_name": "Bidirectional", "config": {"name": "bidirectional_18", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_18", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["max_pooling1d_9", 0, 0, {}]]]}, {"name": "flatten_33", "class_name": "Flatten", "config": {"name": "flatten_33", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional_17", 0, 0, {}]]]}, {"name": "flatten_34", "class_name": "Flatten", "config": {"name": "flatten_34", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["bidirectional_18", 0, 0, {}]]]}, {"name": "time_distributed_17", "class_name": "TimeDistributed", "config": {"name": "time_distributed_17", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_60", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["conv1d_18", 0, 0, {}]]]}, {"name": "time_distributed_18", "class_name": "TimeDistributed", "config": {"name": "time_distributed_18", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_61", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["conv1d_17", 0, 0, {}]]]}, {"name": "concatenate_17", "class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_33", 0, 0, {}], ["flatten_34", 0, 0, {}]]]}, {"name": "flatten_35", "class_name": "Flatten", "config": {"name": "flatten_35", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]]}, {"name": "flatten_36", "class_name": "Flatten", "config": {"name": "flatten_36", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["time_distributed_18", 0, 0, {}]]]}, {"name": "dense_57", "class_name": "Dense", "config": {"name": "dense_57", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "permute_17", "class_name": "Permute", "config": {"name": "permute_17", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["conv1d_18", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["flatten_35", 0, 0, {}]]]}, {"name": "permute_18", "class_name": "Permute", "config": {"name": "permute_18", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["conv1d_17", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["flatten_36", 0, 0, {}]]]}, {"name": "dense_58", "class_name": "Dense", "config": {"name": "dense_58", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_57", 0, 0, {}]]]}, {"name": "dot_17", "class_name": "Dot", "config": {"name": "dot_17", "trainable": true, "dtype": "float32", "axes": -1, "normalize": false}, "inbound_nodes": [[["permute_17", 0, 0, {}], ["activation_17", 0, 0, {}]]]}, {"name": "dot_18", "class_name": "Dot", "config": {"name": "dot_18", "trainable": true, "dtype": "float32", "axes": -1, "normalize": false}, "inbound_nodes": [[["permute_18", 0, 0, {}], ["activation_18", 0, 0, {}]]]}, {"name": "dense_59", "class_name": "Dense", "config": {"name": "dense_59", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_58", 0, 0, {}]]]}, {"name": "concatenate_18", "class_name": "Concatenate", "config": {"name": "concatenate_18", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dot_17", 0, 0, {}], ["dot_18", 0, 0, {}], ["dense_59", 0, 0, {}]]]}, {"name": "dense_62", "class_name": "Dense", "config": {"name": "dense_62", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_18", 0, 0, {}]]]}, {"name": "dense_63", "class_name": "Dense", "config": {"name": "dense_63", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_62", 0, 0, {}]]]}], "input_layers": [["input_17", 0, 0], ["input_18", 0, 0]], "output_layers": [["dense_63", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}